esp8266/Arduino/libraries/ESP8266WiFi/src/WiFiClientSecureBearSSL.cpp
int WiFiClientSecureCtx::connect(IPAddress ip, uint16_t port) {
  if (!WiFiClient::connect(ip, port)) {
    return 0;
  }
  return _connectSSL(nullptr);
}

int WiFiClientSecureCtx::connect(const char* name, uint16_t port) {
  IPAddress remote_addr;
  if (!WiFi.hostByName(name, remote_addr)) {
    DEBUG_BSSL("connect: Name lookup failure\n");
    return 0;
  }
  if (!WiFiClient::connect(remote_addr, port)) {
    DEBUG_BSSL("connect: Unable to connect TCP socket\n");
    return 0;
  }
  return _connectSSL(name);
}

int WiFiClientSecureCtx::connect(const String& host, uint16_t port) {
  return connect(host.c_str(), port);
}

void WiFiClientSecureCtx::_freeSSL() {
  // These are smart pointers and will free if refcnt==0
  _sc = nullptr;
  _sc_svr = nullptr;
  _x509_minimal = nullptr;
  _x509_insecure = nullptr;
  _x509_knownkey = nullptr;
  _iobuf_in = nullptr;
  _iobuf_out = nullptr;
  // Reset non-allocated ptrs (pointing to bits potentially free'd above)
  _recvapp_buf = nullptr;
  _recvapp_len = 0;
  // This connection is toast
  _set_handshake_done(false); // refreshes _timeout
}

bool WiFiClientSecureCtx::_clientConnected() {
  if (!_client || (_client->state() == CLOSED)) {
    return false;
  }

  return _client->state() == ESTABLISHED;
}

bool WiFiClientSecureCtx::_engineConnected() {
  return _clientConnected() && _handshake_done && _eng && (br_ssl_engine_current_state(_eng) != BR_SSL_CLOSED);
}

uint8_t WiFiClientSecureCtx::connected() {
  if (!_engineConnected()) {
    return false;
  }

  if (_pollRecvBuffer() > 0) {
    return true;
  }

  return _engineConnected();
}

int WiFiClientSecureCtx::availableForWrite () {
  // Can't write things when there's no connection or br_ssl engine is closed
  if (!_engineConnected()) {
    return 0;
  }
  // Get BearSSL to a state where we can send
  if (_run_until(BR_SSL_SENDAPP) < 0) {
    return 0;
  }
  if (br_ssl_engine_current_state(_eng) & BR_SSL_SENDAPP) {
    size_t sendapp_len;
    (void)br_ssl_engine_sendapp_buf(_eng, &sendapp_len);
    // We want to call br_ssl_engine_sendapp_ack(0) but 0 is forbidden (bssl doc).
    // After checking br_ssl_engine_sendapp_buf() src code,
    // it seems that it is OK to not call ack when the buffer is left untouched.
    //forbidden: br_ssl_engine_sendapp_ack(_eng, 0);
    return (int)sendapp_len;
  }
  return 0;
}

size_t WiFiClientSecureCtx::_write(const uint8_t *buf, size_t size, bool pmem) {
  size_t sent_bytes = 0;

  if (!size || !_engineConnected()) {
    return 0;
  }

  do {
    // Ensure we yield if we need multiple fragments to avoid WDT
    if (sent_bytes) {
      optimistic_yield(1000);
    }

    // Get BearSSL to a state where we can send
    if (_run_until(BR_SSL_SENDAPP) < 0) {
      break;
    }

    if (br_ssl_engine_current_state(_eng) & BR_SSL_SENDAPP) {
      size_t sendapp_len;
      unsigned char *sendapp_buf = br_ssl_engine_sendapp_buf(_eng, &sendapp_len);
      int to_send = size > sendapp_len ? sendapp_len : size;
      if (pmem) {
        memcpy_P(sendapp_buf, buf, to_send);
      } else {
        memcpy(sendapp_buf, buf, to_send);
      }
      br_ssl_engine_sendapp_ack(_eng, to_send);
      br_ssl_engine_flush(_eng, 0);
      flush();
      buf += to_send;
      sent_bytes += to_send;
      size -= to_send;
    } else {
      break;
    }
  } while (size);

  return sent_bytes;
}

size_t WiFiClientSecureCtx::write(const uint8_t *buf, size_t size) {
  return _write(buf, size, false);
}

size_t WiFiClientSecureCtx::write_P(PGM_P buf, size_t size) {
  return _write((const uint8_t *)buf, size, true);
}

size_t WiFiClientSecureCtx::write(Stream& stream) {
  if (!_engineConnected()) {
    DEBUG_BSSL("write: no br_ssl engine to work with\n");
    return 0;
  }

  return stream.sendAll(this);
}

int WiFiClientSecureCtx::read(uint8_t *buf, size_t size) {
  if (!ctx_present() || !_handshake_done) {
    return -1;
  }

  // will either check the internal buffer, or try to wait for some data
  // *may* attempt to write some pending ::write() data b/c of _run_until
  int avail = _pollRecvBuffer();

  // internal buffer might still be available for some time
  bool engine = _engineConnected();

  // we're still connected, but nothing to read
  if (!avail && engine) {
    return 0;
  }

  // or, available failed to assign the internal buffer and we are already disconnected
  if (!avail && !engine) {
    DEBUG_BSSL("read: Not connected, none left available\n");
    return -1;
  }

  if (avail) {
    // Take data from the recvapp buffer
    int to_copy = _recvapp_len < size ? _recvapp_len : size;
    memcpy(buf, _recvapp_buf, to_copy);
    br_ssl_engine_recvapp_ack(_eng, to_copy);
    _recvapp_buf = nullptr;
    _recvapp_len = 0;
    return to_copy;
  }

  if (!engine) {
    DEBUG_BSSL("read: Not connected\n");
    return -1;
  }

  return 0; // If we're connected, no error but no read.
}

// return a pointer to available data buffer (size = peekAvailable())
// semantic forbids any kind of read() before calling peekConsume()
const char* WiFiClientSecureCtx::peekBuffer ()
{
    return (const char*)_recvapp_buf;
}

// consume bytes after use (see peekBuffer)
void WiFiClientSecureCtx::peekConsume (size_t consume)
{
    // according to WiFiClientSecureCtx::read:
    br_ssl_engine_recvapp_ack(_eng, consume);
    _recvapp_buf = nullptr;
    _recvapp_len = 0;
}

int WiFiClientSecureCtx::read() {
  uint8_t c;
  if (1 == read(&c, 1)) {
    return c;
  }
  return -1;
}

int WiFiClientSecureCtx::_pollRecvBuffer() {
  if (_recvapp_buf) {
    return _recvapp_len;  // Anything from last call?
  }
  _recvapp_buf = nullptr;
  _recvapp_len = 0;
  if (!ctx_present() || _run_until(BR_SSL_RECVAPP, false) < 0) {
    return 0;
  }
  int st = br_ssl_engine_current_state(_eng);
  if (st == BR_SSL_CLOSED) {
    return 0;  // Nothing leftover, SSL is closed
  }
  if (st & BR_SSL_RECVAPP) {
    _recvapp_buf = br_ssl_engine_recvapp_buf(_eng, &_recvapp_len);
    return _recvapp_len;
  }

  return 0;
}

int WiFiClientSecureCtx::available() {
  return _pollRecvBuffer();
}

int WiFiClientSecureCtx::peek() {
  if (!ctx_present() || (0 == _pollRecvBuffer())) {
    DEBUG_BSSL("peek: Not connected, none left available\n");
    return -1;
  }
  if (_recvapp_buf && _recvapp_len) {
    return _recvapp_buf[0];
  }
  DEBUG_BSSL("peek: No data left\n");
  return -1;
}

size_t WiFiClientSecureCtx::peekBytes(uint8_t *buffer, size_t length) {
  size_t to_copy = 0;
  if (!ctx_present()) {
    DEBUG_BSSL("peekBytes: Not connected\n");
    return 0;
  }

  _updateStreamTimeout();
  _startMillis = millis();
  while ((_pollRecvBuffer() < (int)length) && ((millis() - _startMillis) < _timeout)) {
    yield();
  }

  to_copy = _recvapp_len < length ? _recvapp_len : length;
  memcpy(buffer, _recvapp_buf, to_copy);
  return to_copy;
}

/* --- Copied almost verbatim from BEARSSL SSL_IO.C ---
   Run the engine, until the specified target state is achieved, or
   an error occurs. The target state is SENDAPP, RECVAPP, or the
   combination of both (the combination matches either). When a match is
   achieved, this function returns 0. On error, it returns -1.
*/
int WiFiClientSecureCtx::_run_until(unsigned target, bool blocking) {
  if (!ctx_present()) {
    DEBUG_BSSL("_run_until: Not connected\n");
    return -1;
  }

  // _run_until() is called prior to inherited read/write methods
  // -> refreshing _timeout here, which is also used by ancestors
  DEBUG_BSSL("_run_until starts, timeout=%lu\n", _updateStreamTimeout());
  esp8266::polledTimeout::oneShotMs loopTimeout(_updateStreamTimeout());

  for (int no_work = 0; blocking || no_work < 2;) {
    optimistic_yield(100);

